system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoSimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         800;

deltaT          1;

writeControl    timeStep;

writeInterval   100;

purgeWrite      5;

writeFormat     ascii;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

functions
{
    minmaxT
    {
        type			fieldMinMax;
	functionObjectLibs	("libfieldFunctionObjects.so");
	enabled			true;

	write			true;
	writeControl		timeStep;
	writeInterval		1;

	log			true;

	mode			magnitude;

	fields			( T );
    }
    minmaxU
    {
        type			fieldMinMax;
	functionObjectLibs	("libfieldFunctionObjects.so");
	enabled			true;

	write			true;
	writeControl		timeStep;
	writeInterval		1;

	log			true;

	mode			magnitude;

	fields			( U );
    }

    deltaPressure
    {
        type            fieldValueDelta;
        libs ("libfieldFunctionObjects.so");
        operation       subtract;

        region1
        {
            type            surfaceFieldValue;
            libs            ("libfieldFunctionObjects.so");
            log             false;
            writeControl    timeStep;
            writeFields     false;
            regionType      patch;
            name            inlet;
            operation       areaAverage;
            fields          ( p );
        }

        region2
        {
            type            surfaceFieldValue;
            libs            ("libfieldFunctionObjects.so");
            log             false;
            writeControl    timeStep;
            writeFields     false;
            regionType      patch;
            name            outlet;
            operation       areaAverage;
            fields          ( p );
        }
    }

}

// ************************************************************************* //
