system/blockMeshDict
FoamFile 
{
    version    2.0;
    format     ascii;
    class      dictionary;
    object     blockMeshDict;
}

scale   0.001;

vertices
(
    (  5.0  0  -0.5)
    (  60.0  0  -0.5)
    (  60.0  5.0  -0.5)
    (  60.0  50  -0.5)
    (  5.0  50  -0.5)
    (  0.0  50  -0.5)
    (  0.0  5.0  -0.5)
    (  5.0  5.0  -0.5)

    (  5.0  0   0.5)
    (  60.0  0   0.5)
    (  60.0  5.0   0.5)
    (  60.0  50   0.5)
    (  5.0  50   0.5)
    (  0.0  50   0.5)
    (  0.0  5.0   0.5)
    (  5.0  5.0   0.5)

    (  65.0  0  -0.5)
    (  120.0  0  -0.5)
    (  120.0  5.0  -0.5)
    (  120.0  50  -0.5)
    (  65.0  50  -0.5)
    (  60.0  50  -0.5)
    (  60.0  5.0  -0.5)
    (  65.0  5.0  -0.5)

    (  65.0  0   0.5)
    (  120.0  0   0.5)
    (  120.0  5.0   0.5)
    (  120.0  50   0.5)
    (  65.0  50   0.5)
    (  60.0  50   0.5)
    (  60.0  5.0   0.5)
    (  65.0  5.0   0.5)

    (  125.0  0  -0.5)
    (  180.0  0  -0.5)
    (  180.0  5.0  -0.5)
    (  180.0  50  -0.5)
    (  125.0  50  -0.5)
    (  120.0  50  -0.5)
    (  120.0  5.0  -0.5)
    (  125.0  5.0  -0.5)

    (  125.0  0   0.5)
    (  180.0  0   0.5)
    (  180.0  5.0   0.5)
    (  180.0  50   0.5)
    (  125.0  50   0.5)
    (  120.0  50   0.5)
    (  120.0  5.0   0.5)
    (  125.0  5.0   0.5)

    (  185.0  0  -0.5)
    (  240.0  0  -0.5)
    (  240.0  5.0  -0.5)
    (  240.0  50  -0.5)
    (  185.0  50  -0.5)
    (  180.0  50  -0.5)
    (  180.0  5.0  -0.5)
    (  185.0  5.0  -0.5)

    (  185.0  0   0.5)
    (  240.0  0   0.5)
    (  240.0  5.0   0.5)
    (  240.0  50   0.5)
    (  185.0  50   0.5)
    (  180.0  50   0.5)
    (  180.0  5.0   0.5)
    (  185.0  5.0   0.5)

    (  245.0  0  -0.5)
    (  300.0  0  -0.5)
    (  300.0  5.0  -0.5)
    (  300.0  50  -0.5)
    (  245.0  50  -0.5)
    (  240.0  50  -0.5)
    (  240.0  5.0  -0.5)
    (  245.0  5.0  -0.5)

    (  245.0  0   0.5)
    (  300.0  0   0.5)
    (  300.0  5.0   0.5)
    (  300.0  50   0.5)
    (  245.0  50   0.5)
    (  240.0  50   0.5)
    (  240.0  5.0   0.5)
    (  245.0  5.0   0.5)

    (  305.0  0  -0.5)
    (  360.0  0  -0.5)
    (  360.0  5.0  -0.5)
    (  360.0  50  -0.5)
    (  305.0  50  -0.5)
    (  300.0  50  -0.5)
    (  300.0  5.0  -0.5)
    (  305.0  5.0  -0.5)

    (  305.0  0   0.5)
    (  360.0  0   0.5)
    (  360.0  5.0   0.5)
    (  360.0  50   0.5)
    (  305.0  50   0.5)
    (  300.0  50   0.5)
    (  300.0  5.0   0.5)
    (  305.0  5.0   0.5)

    (  365.0  0  -0.5)
    (  420.0  0  -0.5)
    (  420.0  5.0  -0.5)
    (  420.0  50  -0.5)
    (  365.0  50  -0.5)
    (  360.0  50  -0.5)
    (  360.0  5.0  -0.5)
    (  365.0  5.0  -0.5)

    (  365.0  0   0.5)
    (  420.0  0   0.5)
    (  420.0  5.0   0.5)
    (  420.0  50   0.5)
    (  365.0  50   0.5)
    (  360.0  50   0.5)
    (  360.0  5.0   0.5)
    (  365.0  5.0   0.5)

    (  425.0  0  -0.5)
    (  480.0  0  -0.5)
    (  480.0  5.0  -0.5)
    (  480.0  50  -0.5)
    (  425.0  50  -0.5)
    (  420.0  50  -0.5)
    (  420.0  5.0  -0.5)
    (  425.0  5.0  -0.5)

    (  425.0  0   0.5)
    (  480.0  0   0.5)
    (  480.0  5.0   0.5)
    (  480.0  50   0.5)
    (  425.0  50   0.5)
    (  420.0  50   0.5)
    (  420.0  5.0   0.5)
    (  425.0  5.0   0.5)

    (  485.0  0  -0.5)
    (  540.0  0  -0.5)
    (  540.0  5.0  -0.5)
    (  540.0  50  -0.5)
    (  485.0  50  -0.5)
    (  480.0  50  -0.5)
    (  480.0  5.0  -0.5)
    (  485.0  5.0  -0.5)

    (  485.0  0   0.5)
    (  540.0  0   0.5)
    (  540.0  5.0   0.5)
    (  540.0  50   0.5)
    (  485.0  50   0.5)
    (  480.0  50   0.5)
    (  480.0  5.0   0.5)
    (  485.0  5.0   0.5)

    (  545.0  0  -0.5)
    (  600.0  0  -0.5)
    (  600.0  5.0  -0.5)
    (  600.0  50  -0.5)
    (  545.0  50  -0.5)
    (  540.0  50  -0.5)
    (  540.0  5.0  -0.5)
    (  545.0  5.0  -0.5)

    (  545.0  0   0.5)
    (  600.0  0   0.5)
    (  600.0  5.0   0.5)
    (  600.0  50   0.5)
    (  545.0  50   0.5)
    (  540.0  50   0.5)
    (  540.0  5.0   0.5)
    (  545.0  5.0   0.5)

    (  605.0  0  -0.5)
    (  660.0  0  -0.5)
    (  660.0  5.0  -0.5)
    (  660.0  50  -0.5)
    (  605.0  50  -0.5)
    (  600.0  50  -0.5)
    (  600.0  5.0  -0.5)
    (  605.0  5.0  -0.5)

    (  605.0  0   0.5)
    (  660.0  0   0.5)
    (  660.0  5.0   0.5)
    (  660.0  50   0.5)
    (  605.0  50   0.5)
    (  600.0  50   0.5)
    (  600.0  5.0   0.5)
    (  605.0  5.0   0.5)

    (  665.0  0  -0.5)
    (  720.0  0  -0.5)
    (  720.0  5.0  -0.5)
    (  720.0  50  -0.5)
    (  665.0  50  -0.5)
    (  660.0  50  -0.5)
    (  660.0  5.0  -0.5)
    (  665.0  5.0  -0.5)

    (  665.0  0   0.5)
    (  720.0  0   0.5)
    (  720.0  5.0   0.5)
    (  720.0  50   0.5)
    (  665.0  50   0.5)
    (  660.0  50   0.5)
    (  660.0  5.0   0.5)
    (  665.0  5.0   0.5)

    (  720.0  0  -0.5)
    (  970.0  0  -0.5)
    (  970.0  5.0  -0.5)
    (  970.0  50  -0.5)
    (  720.0  50  -0.5)
    (  720.0  5.0  -0.5)

    (  720.0  0   0.5)
    (  970.0  0   0.5)
    (  970.0  5.0   0.5)
    (  970.0  50   0.5)
    (  720.0  50   0.5)
    (  720.0  5.0   0.5)

    (  -750  0  -0.5)
    (  0  0  -0.5)
    (  0  5.0  -0.5)
    (  0  50  -0.5)
    (  -750  50  -0.5)
    (  -750  5.0  -0.5)

    (  -750  0   0.5)
    (  0  0   0.5)
    (  0  5.0   0.5)
    (  0  50   0.5)
    (  -750  50   0.5)
    (  -750  5.0   0.5)

);

blocks
(
    // Block 0 then 1 then 2 for each segment
    hex (0 1 2 7 8 9 10 15)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (7 2 3 4 15 10 11 12)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (6 7 4 5 14 15 12 13)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (16 17 18 23 24 25 26 31)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (23 18 19 20 31 26 27 28)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (22 23 20 21 30 31 28 29)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (32 33 34 39 40 41 42 47)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (39 34 35 36 47 42 43 44)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (38 39 36 37 46 47 44 45)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (48 49 50 55 56 57 58 63)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (55 50 51 52 63 58 59 60)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (54 55 52 53 62 63 60 61)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (64 65 66 71 72 73 74 79)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (71 66 67 68 79 74 75 76)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (70 71 68 69 78 79 76 77)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (80 81 82 87 88 89 90 95)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (87 82 83 84 95 90 91 92)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (86 87 84 85 94 95 92 93)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (96 97 98 103 104 105 106 111)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (103 98 99 100 111 106 107 108)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (102 103 100 101 110 111 108 109)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (112 113 114 119 120 121 122 127)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (119 114 115 116 127 122 123 124)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (118 119 116 117 126 127 124 125)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (128 129 130 135 136 137 138 143)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (135 130 131 132 143 138 139 140)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (134 135 132 133 142 143 140 141)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (144 145 146 151 152 153 154 159)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (151 146 147 148 159 154 155 156)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (150 151 148 149 158 159 156 157)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (160 161 162 167 168 169 170 175)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (167 162 163 164 175 170 171 172)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (166 167 164 165 174 175 172 173)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (176 177 178 183 184 185 186 191)
    (50 10 1)
    simpleGrading (1 8 1)

    hex (183 178 179 180 191 186 187 188)
    (50 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (182 183 180 181 190 191 188 189)
    ( 5 40 1)
    simpleGrading (1 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (192 193 194 197 198 199 200 203)
    (40 10 1)
    simpleGrading (8 8 1)

    hex (197 194 195 196 203 200 201 202)
    (40 40 1)
    simpleGrading (8 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

    hex (204 205 206 209 210 211 212 215)
    (160 10 1)
    simpleGrading (0.125 8 1)

    hex (209 206 207 208 215 212 213 214)
    (160 40 1)
    simpleGrading (0.125 ((0.875 0.75 1)(0.125 0.25 0.125)) 1)

);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (208 209 215 214)
            (209 204 210 215)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (193 194 200 199)
            (194 195 201 200)
        );
    }

    upperWallInlet
    {
        type wall;
        faces
        (
            (207 208 214 213)
        );
    }

    upperWallRibs
    {
        type wall;
        faces
        (
            (3 4 12 11)
            (4 5 13 12)
            (19 20 28 27)
            (20 21 29 28)
            (35 36 44 43)
            (36 37 45 44)
            (51 52 60 59)
            (52 53 61 60)
            (67 68 76 75)
            (68 69 77 76)
            (83 84 92 91)
            (84 85 93 92)
            (99 100 108 107)
            (100 101 109 108)
            (115 116 124 123)
            (116 117 125 124)
            (131 132 140 139)
            (132 133 141 140)
            (147 148 156 155)
            (148 149 157 156)
            (163 164 172 171)
            (164 165 173 172)
            (179 180 188 187)
            (180 181 189 188)
        );
    }

    upperWallOutlet
    {
        type wall;
        faces
        (
            (195 196 202 201)
        );
    }

    lowerWallInlet
    {
        type wall;
        faces
        (
            (204 205 211 210)
        );
    }

    lowerWallRibs1
    {
        type wall;
        faces
        (
            (206 205 211 212)
            (6 7 15 14)
            (7 0 8 15)
            (1 2 10 9)
            (22 23 31 30)
            (23 16 24 31)
            (17 18 26 25)
            (38 39 47 46)
            (39 32 40 47)
            (33 34 42 41)
            (54 55 63 62)
            (55 48 56 63)
            (49 50 58 57)
            (70 71 79 78)
            (71 64 72 79)
            (65 66 74 73)
            (86 87 95 94)
            (87 80 88 95)
            (81 82 90 89)
            (102 103 111 110)
            (103 96 104 111)
            (97 98 106 105)
            (118 119 127 126)
            (119 112 120 127)
            (113 114 122 121)
            (134 135 143 142)
            (135 128 136 143)
            (129 130 138 137)
            (150 151 159 158)
            (151 144 152 159)
            (145 146 154 153)
            (166 167 175 174)
            (167 160 168 175)
            (161 162 170 169)
            (182 183 191 190)
            (183 176 184 191)
        );
    }

    lowerWallRibs2
    {
        type wall;
        faces
        (
            (0 1 9 8)
            (16 17 25 24)
            (32 33 41 40)
            (48 49 57 56)
            (64 65 73 72)
            (80 81 89 88)
            (96 97 105 104)
            (112 113 121 120)
            (128 129 137 136)
            (144 145 153 152)
            (160 161 169 168)
            (176 177 185 184)
        );
    }

    lowerWallOutlet
    {
        type wall;
        faces
        (
            (192 193 199 198)
        );
    }

    front
    {
        type empty;
        faces
        (
            (10 11 12 15)
            (12 13 14 15)
            (8 9 10 15)
            (26 27 28 31)
            (28 29 30 31)
            (24 25 26 31)
            (42 43 44 47)
            (44 45 46 47)
            (40 41 42 47)
            (58 59 60 63)
            (60 61 62 63)
            (56 57 58 63)
            (74 75 76 79)
            (76 77 78 79)
            (72 73 74 79)
            (90 91 92 95)
            (92 93 94 95)
            (88 89 90 95)
            (106 107 108 111)
            (108 109 110 111)
            (104 105 106 111)
            (122 123 124 127)
            (124 125 126 127)
            (120 121 122 127)
            (138 139 140 143)
            (140 141 142 143)
            (136 137 138 143)
            (154 155 156 159)
            (156 157 158 159)
            (152 153 154 159)
            (170 171 172 175)
            (172 173 174 175)
            (168 169 170 175)
            (186 187 188 191)
            (188 189 190 191)
            (184 185 186 191)
            (200 201 202 203)
            (199 200 203 198)
            (212 213 214 215)
            (211 212 215 210)
        );
    }

    back
    {
        type empty;
        faces
        (
            (4 3 2 7)
            (7 2 1 0)
            (5 4 7 6)
            (20 19 18 23)
            (23 18 17 16)
            (21 20 23 22)
            (36 35 34 39)
            (39 34 33 32)
            (37 36 39 38)
            (52 51 50 55)
            (55 50 49 48)
            (53 52 55 54)
            (68 67 66 71)
            (71 66 65 64)
            (69 68 71 70)
            (84 83 82 87)
            (87 82 81 80)
            (85 84 87 86)
            (100 99 98 103)
            (103 98 97 96)
            (101 100 103 102)
            (116 115 114 119)
            (119 114 113 112)
            (117 116 119 118)
            (132 131 130 135)
            (135 130 129 128)
            (133 132 135 134)
            (148 147 146 151)
            (151 146 145 144)
            (149 148 151 150)
            (164 163 162 167)
            (167 162 161 160)
            (165 164 167 166)
            (180 179 178 183)
            (183 178 177 176)
            (181 180 183 182)
            (197 196 195 194)
            (192 197 194 193)
            (209 208 207 206)
            (204 209 206 205)
        );
    }

    Interface0Left
    {
        type wall;
        faces
        (
            (2 3 11 10)
        );
    }

    Interface0Right
    {
        type wall;
        faces
        (
            (21 22 30 29)
        );
    }

    Interface1Left
    {
        type wall;
        faces
        (
            (18 19 27 26)
        );
    }

    Interface1Right
    {
        type wall;
        faces
        (
            (37 38 46 45)
        );
    }

    Interface2Left
    {
        type wall;
        faces
        (
            (34 35 43 42)
        );
    }

    Interface2Right
    {
        type wall;
        faces
        (
            (53 54 62 61)
        );
    }

    Interface3Left
    {
        type wall;
        faces
        (
            (50 51 59 58)
        );
    }

    Interface3Right
    {
        type wall;
        faces
        (
            (69 70 78 77)
        );
    }

    Interface4Left
    {
        type wall;
        faces
        (
            (66 67 75 74)
        );
    }

    Interface4Right
    {
        type wall;
        faces
        (
            (85 86 94 93)
        );
    }

    Interface5Left
    {
        type wall;
        faces
        (
            (82 83 91 90)
        );
    }

    Interface5Right
    {
        type wall;
        faces
        (
            (101 102 110 109)
        );
    }

    Interface6Left
    {
        type wall;
        faces
        (
            (98 99 107 106)
        );
    }

    Interface6Right
    {
        type wall;
        faces
        (
            (117 118 126 125)
        );
    }

    Interface7Left
    {
        type wall;
        faces
        (
            (114 115 123 122)
        );
    }

    Interface7Right
    {
        type wall;
        faces
        (
            (133 134 142 141)
        );
    }

    Interface8Left
    {
        type wall;
        faces
        (
            (130 131 139 138)
        );
    }

    Interface8Right
    {
        type wall;
        faces
        (
            (149 150 158 157)
        );
    }

    Interface9Left
    {
        type wall;
        faces
        (
            (146 147 155 154)
        );
    }

    Interface9Right
    {
        type wall;
        faces
        (
            (165 166 174 173)
        );
    }

    Interface10Left
    {
        type wall;
        faces
        (
            (162 163 171 170)
        );
    }

    Interface10Right
    {
        type wall;
        faces
        (
            (181 182 190 189)
        );
    }

    InterfaceInletLeft
    {
        type patch;
        faces
        (
            (206 207 213 212)
        );
    }

    InterfaceInletRight
    {
        type patch;
        faces
        (
            (5 6 14 13)
        );
    }

    InterfaceOutletLeft
    {
        type patch;
        faces
        (
            (196 197 203 202)
            (197 192 198 203)
        );
    }

    InterfaceOutletRight
    {
        type patch;
        faces
        (
            (178 179 187 186)
            (177 178 186 185)
        );
    }

);

mergePatchPairs
(

    ( Interface0Left Interface0Right )
    ( Interface1Left Interface1Right )
    ( Interface2Left Interface2Right )
    ( Interface3Left Interface3Right )
    ( Interface4Left Interface4Right )
    ( Interface5Left Interface5Right )
    ( Interface6Left Interface6Right )
    ( Interface7Left Interface7Right )
    ( Interface8Left Interface8Right )
    ( Interface9Left Interface9Right )
    ( Interface10Left Interface10Right )
    ( InterfaceInletLeft InterfaceInletRight )
    ( InterfaceOutletLeft InterfaceOutletRight )
);

