0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 101325;
    }
    upperWallInlet
    {
        type            zeroGradient;
    }
    upperWallRibs
    {
        type            zeroGradient;
    }
    upperWallOutlet
    {
        type            zeroGradient;
    }
    lowerWallInlet
    {
        type            zeroGradient;
    }
    lowerWallRibs1
    {
        type            zeroGradient;
    }
    lowerWallRibs2
    {
        type            zeroGradient;
    }
    lowerWallOutlet
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
