system/gnuplotScript2
Dir0 = "`pwd`"
Dir1 = Dir0."/postProcessing/sampleDict2/800/"
Dir2 = Dir0."/postProcessing/sampleDict1/800/"
Dir3 = Dir0."/postProcessing/"

cd Dir0

set term png


f(x) = a*x + b
fit f(x) Dir2.'pressDropCenterlineRibs_p.xy' u ($1*1000):($2-101325) via a, b
title_f(a,b) = sprintf('Slope %.6f Pa/mm', a)



set key right top
set xlabel 'x (mm)'
set ylabel 'Gage Pressure (Pa)'
set title 'Centerline Pressure Drop'
set grid
set output Dir3."midlinePressureDrop.png"
plot [][] Dir2.'pressDropCenterline_p.xy' u ($1*1000):($2-101325) w l t "OpenFoam", f(x) t title_f(a,b), Dir2.'pressDropCenterlineRibs_p.xy' u ($1*1000):($2-101325) w l t "Developed Section"



set key right top
set xlabel 'x (m)'
set ylabel 'y+'
set title 'Lower Wall Turbulence Wall Function y+'
set grid
set output Dir3."lowerWallyPlus.png"
plot [][] Dir1.'lowerWall_yPlus_wallHeatFlux_T.xy' u ($1):($2) w l title "OpenFoam"


set key right top
set xlabel 'x (m)'
set ylabel 'q (W/m^2)'
set title 'Lower Wall Heat Flux'
set grid
set output Dir3."lowerWallHeatFlux.png"
plot [][] Dir1.'lowerWall_yPlus_wallHeatFlux_T.xy' u ($1):($3) w l title "OpenFoam"


set key right top
set xlabel 'x (m)'
set ylabel 'T (deg C)'
set title 'Lower Wall Temperature'
set grid
set output Dir3."lowerWallTemp.png"
plot [][] Dir1.'lowerWall_yPlus_wallHeatFlux_T.xy' u ($1):($4-273.15) w l title "OpenFoam"


