system/sampleDict1
type            	sets;
libs            	("libsampling.so");

writeControl    	writeTime;

//interpolationScheme 	cell;
//interpolationScheme 	cellPatchConstrained;
//interpolationScheme 	cellPoint;
interpolationScheme 	cellPointFace;
//interpolationScheme 	pointMVC;

setFormat       	raw;

sets
(
    pressDropCenterline
    {
        type    lineUniform;
//              type    lineCell;
//              type    lineFace;
//              type    lineCellFace;
        axis    x;
        start   (-0.750 0.025 0.0);
        end     (0.970 0.025 0.0);
        nPoints 1721;
    }

    pressDropCenterlineRibs
    {
        type    lineUniform;
        axis    x;
        start   (0.3 0.025 0.0);
        end     (0.6 0.025 0.0);
        nPoints 301;
    }
);

fields          ( p );
