Allrun
#
# Clean the file structure for a new run
#
rm -r constant/polyMesh
rm -r logs
rm -r Gnuplotting.analyzed
rm PyFoam*
rm *.foam
rm -r postProcessing
rm -r [1-9]*
rm system/blockMeshDict
rm -r 0/uniform
rm 0/wallHeatFlux 0/wallShearStress 0/yPlus
rm fit.log


#
# Run the simulation
#
python system/ribRoughened_blockMesh.py
mv blockMeshDict system/
blockMesh
checkMesh
renumberMesh -overwrite
pyFoamPlotRunner.py --clear-case --hardcopy --with-all rhoSimpleFoam



#
# View the convergence v1
#
#pyFoamTimelinePlot.py . --dir=postProcessing/probes_Uref --info
#pyFoamTimelinePlot.py . --dir=postProcessing/probes_Uref --basic-mode=lines | gnuplot
#mkdir logs
#mv *.png logs/
#feh -w logs/*.png
#mirage logs/ &




#
# View the convergence v2
#
foamLog *.logfile
gnuplot system/gnuplotScript1
mv *.png logs/
mirage logs/ &



#
# Postprocess Data
#
rhoSimpleFoam -postProcess -func yPlus -latestTime
rhoSimpleFoam -postProcess -func wallShearStress -latestTime
rhoSimpleFoam -postProcess -func wallHeatFlux -latestTime

postProcess -latestTime -func 'flowRatePatch(name=inlet)'
postProcess -latestTime -func 'patchIntegrate(name=lowerWallRibs2,wallHeatFlux)'
postProcess -func sampleDict1 -latestTime

postProcess -func sampleDict2 -latestTime
gnuplot system/gnuplotScript2
mirage postProcessing/ &
